forks/wsdm-monitoring/esb-monitoring/base-monitoring/src/test/resources/test/addNewExchange/addNewExchangeRequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:wsdm="http://petals.ow2.org/wsdm">
	<soapenv:Header />
	<soapenv:Body>
		<wsdm:addNewExchangeRequest>
			<serviceName>{http://www.webserviceX.NET/}StockQuote</serviceName>
			<endpointName>StockQuoteSoap1</endpointName>
			<interfaceName>{http://www.webserviceX.NET/}</interfaceName>
			<operationName>GetQuote</operationName>
			<wsdm:request>
				<web:GetQuote xmlns:web="http://www.webserviceX.NET/">
					<web:symbol>ebm</web:symbol>
				</web:GetQuote>
			</wsdm:request>
			<wsdm:response>
				<web:GetQuoteResponse xmlns:web="http://www.webserviceX.NET/">
					<web:GetQuoteResult>very much</web:GetQuoteResult>
				</web:GetQuoteResponse>
			</wsdm:response>
			<startExchange>2002-10-10T12:00:00-05:00</startExchange>
			<endExchange>2002-10-10T12:00:00-05:00</endExchange>
			<responseType>SUCCESS</responseType>
		</wsdm:addNewExchangeRequest>
	</soapenv:Body>
</soapenv:Envelope>